Terraform plan in __terraform__
<details>
<summary>Plan: 1 to add, 4 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.gmail_notifier_initWatch_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_initWatch_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/initWatch"
        name                  = "initWatch"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#ac5a4c93706f495e6bbc51a4d6d620ff"
        # (15 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_oauth2callback_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2callback_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2callback"
        name                  = "oauth2callback"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#ac5a4c93706f495e6bbc51a4d6d620ff"
        # (15 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_oauth2init_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2init_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2init"
        name                  = "oauth2init"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#ac5a4c93706f495e6bbc51a4d6d620ff"
        # (15 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_onNewMessage_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_onNewMessage_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/onNewMessage"
        name                  = "onNewMessage"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#ac5a4c93706f495e6bbc51a4d6d620ff"
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.gmail_notifier_archive_bucket_object must be replaced
-/+ resource "google_storage_bucket_object" "gmail_notifier_archive_bucket_object" {
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "+Wzw0w==" -> (known after apply)
      ~ detect_md5hash   = "+KcLZ9PrgIJaEpuCVmquQQ==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "******************************************************************************" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "+KcLZ9PrgIJaEpuCVmquQQ==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/lilaobot-functions-storage/o/gmail_notifier.zip%23f8a70b67d3eb80825a129b82566aae41?generation=1639651737231658&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "gmail_notifier.zip#f8a70b67d3eb80825a129b82566aae41" -> "gmail_notifier.zip#ac5a4c93706f495e6bbc51a4d6d620ff" # forces replacement
      ~ output_name      = "gmail_notifier.zip#f8a70b67d3eb80825a129b82566aae41" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/lilaobot-functions-storage/o/gmail_notifier.zip%23f8a70b67d3eb80825a129b82566aae41" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #51](https://github.com/Zenika/lilaobot/actions/runs/1654561033)